main.floors.infUN3=
{
    "floorId": "infUN3",
    "title": "无限宇宙",
    "name": "无限宇宙",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "images": [
        {
            "name": "iu.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 1,
    "defaultGround": 892,
    "bgm": "inf.mp3",
    "firstArrive": [
        "\t[零]\b[up,3,6]新人，欢迎来到商店区。",
        "\t[零]\b[up,3,6]请先不要管其他的地方，\n注意\r[lime]最右边\r的那里，\n那是\r[orange]基础无限点数商店\r。",
        "\t[零]\b[up,3,6]物美价廉的升级，\n高额的性价比，\n你应该很快可以搬空前几阶商店。",
        "\t[零]\b[up,3,6]对于刚出【培养皿】的新人而言，\n这无疑是非常好的过渡。",
        "\t[零]\b[up,3,6]当你在\r[orange]无限\r的道路上更进一步时，\n我会向你介绍更多内容。",
        "\t[零]\b[up,3,6]包括我这里，\r[gold]无限层级\r的正物质商店，\n以及右上角那个AI智障的食品商店……\n等等等等。",
        "\t[零]\b[up,3,6]如果还是觉得好奇，\n就进入右下角的传送阵，\n找我和夕儿的本体聊聊天吧。"
    ],
    "eachArrive": [],
    "parallelDo": "var lastTime = core.getFlag('lastTime', 0);\n\nif (Date.now() - lastTime > 80) {\n\tvar image = core.material.images.images['iu.png'];\n\tvar width = 416,\n\t\theight = 416;\n\n\tcore.canvas.bg.translate(width / 2, height / 2);\n\tcore.canvas.bg.rotate(Math.PI / 180 / 6);\n\tcore.canvas.bg.translate(-width / 2, -height / 2);\n\tcore.canvas.bg.drawImage(image, -288, -96);\n\n\tcore.setFlag('lastTime', Date.now());\n\n\tvar rotateTime = core.getFlag('rotateTime', 0);\n\trotateTime += 1;\n\tif (rotateTime >= 6 * 180) {\n\t\trotateTime -= 6 * 180;\n\t}\n\tcore.setFlag('rotateTime', rotateTime);\n}",
    "events": {
        "12,6": [
            {
                "type": "if",
                "condition": "(flag:infs10+flag:infs11+flag:infs12+flag:infs13+flag:infs15+flag:infs16+flag:infs14>=10)",
                "true": [
                    {
                        "type": "insert",
                        "name": "反物质潮汐7"
                    }
                ],
                "false": [
                    {
                        "type": "if",
                        "condition": "(flag:infs1+flag:infs2+flag:infs3+flag:infs4+flag:infs5+flag:infs6+flag:infs7+flag:infs8+flag:infs9>=13)",
                        "true": [
                            {
                                "type": "insert",
                                "name": "反物质潮汐5"
                            }
                        ],
                        "false": [
                            {
                                "type": "insert",
                                "name": "反物质潮汐4"
                            }
                        ]
                    }
                ]
            }
        ],
        "3,6": [
            {
                "type": "comment",
                "text": "超过无限且不会重置的正物质商店！"
            },
            {
                "type": "if",
                "condition": "(flag:inflv==0)",
                "true": [
                    "\t[零]\b[up,3,6]新人，这个商店还没有向你开放。\n以你的天赋，不应该好高鹭远。"
                ],
                "false": []
            }
        ],
        "9,4": [
            "\t[蒙面人]\b[down,9,1]…………"
        ],
        "3,3": [
            "意义不明的大鸟笼……"
        ]
    },
    "changeFloor": {
        "9,10": {
            "floorId": "infUN5",
            "loc": [
                6,
                0
            ],
            "direction": "down"
        },
        "0,6": {
            "floorId": "InfUN",
            "loc": [
                12,
                6
            ],
            "direction": "left"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [173,173,173,173,173,173,173,173,173,173,173,173,173],
    [173,173,173,173,173,173,173,173,173,173,173,173,173],
    [173,173,173,  0,173,173,173,173,173,200694,173,173,173],
    [173,173,200858,200859,200860,173,173,173,200709,200710,200711,173,173],
    [173,  0,  0,  0,  0,173,173,173,200717,200718,200719,  0,173],
    [173,  0,  0,  0,  0,  0,173,  0,  0,  0,  0,  0,173],
    [905,  0,  0,762,  0,  0,  0,  0,  0,  0,  0,  0,200983],
    [173,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,173],
    [173,  0,  0,  0,  0,  0,173,  0,  0,  0,  0,  0,173],
    [173,173,  0,  0,  0,173,173,173,  0,  0,  0,173,173],
    [173,173,173,201242,173,173,173,173,173,905,173,173,173],
    [173,173,173,173,173,173,173,173,173,173,173,173,173],
    [173,173,173,173,173,173,173,173,173,173,173,173,173]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,200842,200843,200844,  0,  0,  0,  0,200694,  0,  0,  0],
    [  0,  0,200850,200851,200852,  0,  0,  0,200701,200702,200703,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,200975],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,201234,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,10249,  0,  0,  0,10179,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,10232,  0,10183,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,808,  0,  0,  0],
    [  0,  0,808,808,808,  0,  0,  0,808,808,808,  0,  0],
    [  0,808,808,808,808,  0,  0,  0,808,808,808,808,  0],
    [  0,808,808,808,808,808,  0,808,808,808,808,808,  0],
    [808,808,808,808,808,808,808,808,808,808,808,808,808],
    [  0,808,808,808,808,808,808,808,808,808,808,808,  0],
    [  0,808,808,808,808,808,  0,808,808,808,808,808,  0],
    [  0,  0,808,808,808,  0,  0,  0,808,808,808,  0,  0],
    [  0,  0,  0,808,  0,  0,  0,  0,  0,808,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}