main.floors.infUN5=
{
    "floorId": "infUN5",
    "title": "无限宇宙",
    "name": "无限宇宙",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "images": [
        {
            "name": "iu.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 1,
    "defaultGround": 892,
    "bgm": "inf.mp3",
    "firstArrive": [
        {
            "type": "comment",
            "text": "聊天摸鱼室~"
        }
    ],
    "eachArrive": [],
    "parallelDo": "var lastTime = core.getFlag('lastTime', 0);\n\nif (Date.now() - lastTime > 80) {\n\tvar image = core.material.images.images['iu.png'];\n\tvar width = 416,\n\t\theight = 416;\n\n\tcore.canvas.bg.translate(width / 2, height / 2);\n\tcore.canvas.bg.rotate(Math.PI / 180 / 6);\n\tcore.canvas.bg.translate(-width / 2, -height / 2);\n\tcore.canvas.bg.drawImage(image, -288, -96);\n\n\tcore.setFlag('lastTime', Date.now());\n\n\tvar rotateTime = core.getFlag('rotateTime', 0);\n\trotateTime += 1;\n\tif (rotateTime >= 6 * 180) {\n\t\trotateTime -= 6 * 180;\n\t}\n\tcore.setFlag('rotateTime', rotateTime);\n}",
    "events": {
        "4,1": [
            {
                "type": "switch",
                "condition": "flag:xier2",
                "caseList": [
                    {
                        "case": "0",
                        "action": [
                            {
                                "type": "animate",
                                "name": "xihuan"
                            },
                            "\t[夕儿]\b[down,4,1]嗯？新人，怎么想到来这边玩啦。",
                            "\t[夕儿]\b[down,4,1]你问为什么这里有两张床还有梳妆台？\n自然是生活区啦。",
                            "\t[夕儿]\b[down,4,1]用纯粹的意识搭建的，\n怎么样，还不错吧？",
                            "\t[夕儿]\b[down,4,1]想睡什么样的床，放什么样的东西，\n全都看你自己的心情哦。",
                            {
                                "type": "setValue",
                                "name": "flag:xier2",
                                "operator": "+=",
                                "value": "1"
                            }
                        ]
                    },
                    {
                        "case": "1",
                        "action": [
                            "\t[夕儿]\b[down,4,1]聊天系统加载中……\n加载失败！问题请咨询作者！"
                        ]
                    },
                    {
                        "case": "2",
                        "action": []
                    }
                ]
            }
        ],
        "8,1": [
            {
                "type": "switch",
                "condition": "flag:ling2",
                "caseList": [
                    {
                        "case": "0",
                        "action": [
                            {
                                "type": "animate",
                                "name": "wuyu"
                            },
                            "\t[零]\b[down,8,1]注意到那些白色的光点了吗？\n每一个光点，都代表了一个\n包含无限反物质的宇宙。",
                            "\t[零]\b[down,8,1]每一层无限宇宙之中，\n都包含10081个这样的反物质宇宙，\n之中孕育有不计其数的生命。",
                            "\t[零]\b[down,8,1]当反物质宇宙中，\n出现一个拥有\r[yellow]无限\r反物质的生命体，\n它便能跳出低层面的桎梏，进入无限宇宙。",
                            "\t[零]\b[down,8,1]当然，它所在的反物质宇宙也将迎来大坍缩——\n结束它的使命，培养\r[#66CCFF]【无限者】\r的使命。",
                            {
                                "type": "setValue",
                                "name": "flag:ling2",
                                "operator": "+=",
                                "value": "1"
                            }
                        ]
                    },
                    {
                        "case": "1",
                        "action": [
                            "\t[零]\b[down,8,1]聊天系统未成功加载。\n具体问题请咨询作者解决。"
                        ]
                    },
                    {
                        "case": "2",
                        "action": []
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "6,0": {
            "floorId": "infUN3",
            "loc": [
                9,
                10
            ],
            "direction": "up"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [173,173,173,173,173,173,905,173,173,173,173,173,173],
    [173,173,173,173,886,  0,  0,  0,762,173,173,173,173],
    [173,173,173,31452,31453,  0,  0,  0,31454,31455,173,173,173],
    [173,173,31128,31460,31461,  0,  0,  0,31462,31463,31144,173,173],
    [173,173,173,31468,31469,  0,  0,  0,31470,31471,173,173,173],
    [173,173,173,173,173,  0,  0,  0,173,173,173,173,173],
    [173,173,173,173,173,173, 85,173,173,173,173,173,173],
    [173,173,173,173,173,  0,  0,  0,173,173,173,173,173],
    [173,173,173,10180,10245,  0,  0,  0,10234,10232,173,173,173],
    [173,173,10178,  0,  0,  0,  0,  0,  0,  0,10249,173,173],
    [173,173,173,  0,200848,200849,200602,200848,200849,  0,173,173,173],
    [173,173,173,173,200856,200857,200610,200856,200857,173,173,173,173],
    [173,173,173,173,173,173,200610,173,173,173,173,173,173]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,31120,  0,  0,  0,  0,  0,  0,  0,31120,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,200573,200574,200575,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,200589,200590,200591,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,809,809,809,809,809,  0,  0,  0,  0],
    [  0,  0,  0,809,809,809,809,809,809,809,  0,  0,  0],
    [  0,  0,809,809,809,809,809,809,809,809,809,  0,  0],
    [  0,  0,  0,809,809,809,809,809,809,809,  0,  0,  0],
    [  0,  0,  0,  0,  0,809,809,809,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,809,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,809,809,809,  0,  0,  0,  0,  0],
    [  0,  0,  0,809,809,809,809,809,809,809,  0,  0,  0],
    [  0,  0,809,809,809,809,809,809,809,809,809,  0,  0],
    [  0,  0,  0,809,809,809,809,809,809,809,  0,  0,  0],
    [  0,  0,  0,  0,809,809,809,809,809,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,809,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}