main.floors.infUN2=
{
    "floorId": "infUN2",
    "title": "无限宇宙",
    "name": "无限宇宙",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "images": [
        {
            "name": "iu.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 1,
    "defaultGround": 892,
    "bgm": "inf.mp3",
    "firstArrive": [
        "\t[夕儿]\b[up,9,6]如你所见，\n这里的内容多是里程碑式的升级。",
        "\t[夕儿]\b[up,9,6]目前这个阶段，嗯……\n就先注意一下\r[lime]右下角\r的那三座\n\r[gold]无限次数里程碑\r就好了。",
        "\t[夕儿]\b[up,9,6]之后是\r[lime]右上角\r的无限晋升器，\n至于复制器啊挑战啊什么乱七八糟的，\n那就太遥远了。",
        "\t[夕儿]\b[up,9,6]当然啦，在无限这一层级，\n我也可以为你提供反物质星系里程碑。",
        "\t[夕儿]\b[up,9,6]你问我和中图那个有什么区别？\n笨蛋啦，都说了是在\r[gold]无限层级\r。",
        "\t[夕儿]\b[up,9,6]也就是说——\n这里的加成不会随着大坍缩而消失。",
        "\t[夕儿]\b[up,9,6]是不是觉得很方便好用？\n别急……它的要求是很高的哦。\n现在的你暂时是无法达到。",
        "\t[夕儿]\b[up,9,6]所以暂时就，恕不开放啦。\n虽然以你表现出来的天赋，\n也不需要多久就是了。",
        "\t[夕儿]\b[up,9,6]总之，在你成为\r[#66CCFF]无限者\r前，\n就先不要考虑那么多啦。"
    ],
    "eachArrive": [],
    "parallelDo": "var lastTime = core.getFlag('lastTime', 0);\n\nif (Date.now() - lastTime > 80) {\n\tvar image = core.material.images.images['iu.png'];\n\tvar width = 416,\n\t\theight = 416;\n\n\tcore.canvas.bg.translate(width / 2, height / 2);\n\tcore.canvas.bg.rotate(Math.PI / 180 / 6);\n\tcore.canvas.bg.translate(-width / 2, -height / 2);\n\tcore.canvas.bg.drawImage(image, -288, -96);\n\n\tcore.setFlag('lastTime', Date.now());\n\n\tvar rotateTime = core.getFlag('rotateTime', 0);\n\trotateTime += 1;\n\tif (rotateTime >= 6 * 180) {\n\t\trotateTime -= 6 * 180;\n\t}\n\tcore.setFlag('rotateTime', rotateTime);\n}",
    "events": {
        "9,10": [
            {
                "type": "insert",
                "name": "反物质潮汐"
            }
        ],
        "0,6": [
            "达到 \r[orange]9223372036 无限点数\r，\n可以解锁复制器。"
        ],
        "9,6": [
            {
                "type": "if",
                "condition": "(flag:inflv==0)",
                "true": [
                    "\t[夕儿]\b[up,9,6]这里是无限层级的星系里程碑，\n但暂时不会对你开放。",
                    "\t[夕儿]\b[up,9,6]在你成为\r[#66CCFF]无限者\r前，\n就先不要考虑那么多啦。"
                ],
                "false": []
            },
            {
                "type": "comment",
                "text": "超过无限且不会重置的星系里程碑！"
            }
        ],
        "9,3": [
            {
                "type": "if",
                "condition": "(item:I738==0)",
                "true": [
                    "请刻录无限里程碑，\n召唤无限图腾，\n以打破无限，成为\r[#66CCFF]无限者\r。"
                ],
                "false": [
                    {
                        "type": "if",
                        "condition": "(flag:inferup==0)",
                        "true": [
                            {
                                "type": "setCurtain",
                                "color": [
                                    255,
                                    255,
                                    255,
                                    1
                                ],
                                "time": 1000,
                                "keep": true
                            },
                            {
                                "type": "changeFloor",
                                "floorId": "inflevel",
                                "loc": [
                                    6,
                                    3
                                ],
                                "direction": "down"
                            }
                        ],
                        "false": [
                            {
                                "type": "changeFloor",
                                "floorId": "inflevel",
                                "loc": [
                                    6,
                                    3
                                ],
                                "direction": "down"
                            }
                        ]
                    }
                ]
            }
        ],
        "10,9": [
            {
                "type": "if",
                "condition": "(flag:wx9==1)",
                "true": [
                    {
                        "type": "insert",
                        "name": "反物质潮汐6"
                    }
                ],
                "false": [
                    "尚未抵达第二无限次数里程碑。\n请先购买前一里程碑的\r[yellow]最后一项升级\r。"
                ]
            }
        ],
        "8,9": [
            {
                "type": "if",
                "condition": "(flag:wx17==1)",
                "true": [
                    {
                        "type": "insert",
                        "name": "反物质潮汐8"
                    }
                ],
                "false": [
                    "尚未抵达第三无限次数里程碑。\n请先购买前一里程碑的\r[yellow]最后一项升级\r。"
                ]
            }
        ]
    },
    "changeFloor": {
        "3,2": {
            "floorId": "infUN4",
            "loc": [
                6,
                12
            ],
            "direction": "up"
        },
        "12,6": {
            "floorId": "InfUN",
            "loc": [
                0,
                6
            ],
            "direction": "right"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [173,173,173,173,173,173,173,173,173,173,173,173,173],
    [173,173,173,173,173,173,173,173,173,173,173,173,173],
    [173,173,173,905,173,173,173,173,173,200729,173,173,173],
    [173,173,  0,  0,  0,173,173,173,200744,200745,200746,173,173],
    [173,  0,  0,  0,  0,  0,173,  0,  0,  0,  0,  0,173],
    [173,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,173],
    [200305,  0,  0,  0,  0,  0,  0,  0,  0,886,  0,  0,905],
    [173,  0,  0,  0,  0,  0,173,  0,  0,  0,  0,  0,173],
    [173,  0,  0,  0,  0,173,173,173,  0,  0,  0,  0,173],
    [173,173,  0,  0,  0,173,173,173,200841,  0,200841,173,173],
    [173,173,173,201413,173,173,173,173,173,200841,173,173,173],
    [173,173,173,173,173,173,173,173,173,173,173,173,173],
    [173,173,173,173,173,173,173,173,173,173,173,173,173]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,200720,200721,200722,  0,  0],
    [  0,  0,10235,10180,10243,  0,  0,  0,200728,200729,200730,  0,  0],
    [  0,10169,  0,  0,  0,10243,  0,  0,200736,200737,200738,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [200297,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,200833,  0,200833,  0,  0],
    [  0,  0,  0,201405,  0,  0,  0,  0,  0,200833,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,10188,  0,10187,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,10186,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,808,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,808,808,808,  0,  0,  0,808,808,808,  0,  0],
    [  0,808,808,808,808,808,  0,808,808,808,808,808,  0],
    [  0,808,808,808,808,808,808,808,808,808,808,808,  0],
    [808,808,808,808,808,808,808,808,808,808,808,808,808],
    [  0,808,808,808,808,808,  0,808,808,808,808,808,  0],
    [  0,808,808,808,808,  0,  0,  0,808,808,808,808,  0],
    [  0,  0,808,808,808,  0,  0,  0,808,808,808,  0,  0],
    [  0,  0,  0,808,  0,  0,  0,  0,  0,808,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}